taurus.yml
execution:
  # Ejecución de los diferentes escenarios que definimos más abajo
  - scenario: libros
    # 1000 clientes
    concurrency: 1000
    # Aguantar hasta 30 segundos
    hold-for: 30s
    # Tiempo que tarda en alcanzar el máximo de clientes
    ramp-up: 15s
  
  - scenario: prestamos
    concurrency: 1000
    hold-for: 30s
    ramp-up: 15s

  - scenario: usuarios
    concurrency: 1000
    hold-for: 30s
    ramp-up: 15s
  
scenarios:
  libros:
    # Dirección del microservicio con su correspondiente puerto
    default-address: http://0.0.0.0:6001
    timeout: 5s
    # Petición
    requests:
      - url: /libros
        method: GET
        headers:
          Content-Type: application/json

  prestamos:
    default-address: http://0.0.0.0:6002
    timeout: 5s
    requests:
      - url: /prestamos
        method: GET
        headers:
          Content-Type: application/json

  usuarios:
    default-address: http://0.0.0.0:6003
    timeout: 5s
    requests:
      - url: /usuarios
        method: GET
        headers:
          Content-Type: application/json