taurus.yml
execution:
  # Ejecución de los diferentes escenarios que definimos más abajo
  - scenario: libros
    # 25 clientes
    concurrency: 25
    # Test de 15 segundos
    hold-for: 15s
    # Tiempo que tarda en alcanzar el máximo de clientes
    ramp-up: 5s
  
  - scenario: prestamos
    concurrency: 25
    hold-for: 15s
    ramp-up: 5s

  - scenario: usuarios
    concurrency: 25
    hold-for: 15s
    ramp-up: 5s
  
scenarios:
  libros:
    # Dirección del microservicio con su correspondiente puerto
    default-address: http://0.0.0.0:6001
    timeout: 5s
    # Petición
    requests:
      - url: /libros
        method: GET
        headers:
          Content-Type: application/json

  prestamos:
    default-address: http://0.0.0.0:6002
    timeout: 5s
    requests:
      - url: /prestamos
        method: GET
        headers:
          Content-Type: application/json

  usuarios:
    default-address: http://0.0.0.0:6003
    timeout: 5s
    requests:
      - url: /usuarios
        method: GET
        headers:
          Content-Type: application/json