taurus.yml
execution:
  - scenario: libros
    concurrency: 2
    hold-for: 7s
    ramp-up: 5s
  
scenarios:
  libros:
    # IP del microservicio
    default-address: http://localhost:6001
    timeout: 10s
    requests:
      - url: /libros/
        method: GET
        headers:
          Content-Type: application/json